#+TITLE: Eval Classes
#+AUTHOR: Rodrigo Garía Gómez
#+EMAIL: rodrigo.garcia21111@gmail.com

**** test
#+BEGIN_SRC lisp +n -r :results output :exports both.lisp
  (let* ((n 1) 
	(dist-node (new-input-distance-node n)))
  (format t "~a" dist-node))
#+END_SRC

#+RESULTS:
: <Distance node, first-distance-calculator: NIL, second-distance-calculator: NIL, content: 1>

**** code
#+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/eval-classes.lisp
  (def-vrp-class input-depot-node (input-distance-demand-node)
    ()
    :documentation "vehicle node in eval-graph"
    :constructor (new-input-depot-node (&key content))
    :print-object-string ("<depot node ~a, ~%     first-distance-calculator: ~a, ~%     second-distance-calculator: ~a, ~%     demand-calculator: ~a>" content first-distance-calculator second-distance-calculator demand-calculator)
    :slots-for-obj= (content demand-calculator first-distance-calculator second-distance-calculator)
    :slots-for-clone (content demand-calculator first-distance-calculator second-distance-calculator))
#+END_SRC

#+RESULTS:
: INPUT:
: NXT INPUT
: OUTPUT:
: PREV OUTPUT

